{"command.restartServer":"Redémarrer le serveur","extension.description":"Prise en charge du linting pour les fichiers Python à l’aide de Pylint.","settings.args.description":"Arguments passés à Pylint pour le linting des fichiers Python. Chaque argument doit être fourni en tant que chaîne distincte dans le tableau. \n Exemples :  \n- `\"pylint.args\": [\"--rcfile=<file>\"]` \n - `\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Définit le répertoire de travail actuel utilisé pour lint fichiers Python avec Pylint. Par défaut, il utilise le répertoire racine de l’espace de travail '${workspaceFolder}'. Vous pouvez la définir sur « ${fileDirname} » pour utiliser le dossier parent du fichier en cours de création comme répertoire de travail pour Pylint.","settings.enabled.description":"Activez/désactivez le linting des fichiers Python avec Pylint.","settings.ignorePatterns.description":"Configurez [glob patterns](https://docs.python.org/3/library/fnmatch.html) comme le fait la bibliothèque Python fnmatch pour exclure des fichiers ou des dossiers du marquage avec Pylint.","settings.importStrategy.description":"Définit le fichier binaire Pylint à utiliser pour linter des fichiers Python. Lorsque la valeur est « useBundled », l’extension utilise le fichier binaire Pylint fourni avec l’extension. Quand la valeur est 'fromEnvironment', l’extension tente d’utiliser le binaire Mypy et toutes les dépendances disponibles dans l’environnement actuellement sélectionné. Remarque : si l’extension ne parvient pas à trouver un binaire Pylint valide dans l’environnement sélectionné, elle revient à utiliser le fichier binaire Pylint fourni avec l’extension Le paramètre « pylint.path » peut également être ignoré lorsque ce paramètre est défini sur « fromEnvironment ».","settings.importStrategy.fromEnvironment.description":"Utilisez Pylint de l’environnement sélectionné. Si l’extension ne parvient pas à trouver un binaire Pylint valide, elle utilisera la version groupée de Pylint.","settings.importStrategy.useBundled.description":"Toujours utiliser la version groupée de Pylint expédiée avec l’extension.","settings.interpreter.description":"Chemin d’un exécutable Python ou d’une commande qui sera utilisée pour lancer le serveur Pylint et tous les sous-processus. Accepte un tableau d’une ou plusieurs chaînes.  Quand la valeur est '[]', l’extension utilise le chemin de l’interpréteur Python sélectionné. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau.","settings.lintOnChange.description":"Activez le linting des fichiers Python avec Pylint au cours de la frappe.","settings.path.description":"Chemin d’accès ou commande à utiliser par l’extension pour lint fichiers Python avec Pylint. Accepte un tableau d’une ou plusieurs chaînes. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau. S’il est défini sur « [\"pylint\"] »,il utilise la version de Pylint disponible dans la variable d’environnement 'PATH'. Remarque : l’utilisation de cette option peut ralentir le linting. \nExemples : \n- `[\"~/global_env/pylint\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"]` \n `[\"pylint\"]`","settings.severity.description":"Mappage des types de messages de Pylint aux niveaux de gravité de diagnostic de VS Code, comme indiqué dans la fenêtre Problèmes. Vous pouvez également l’utiliser pour remplacer des codes d’erreur Pylint spécifiques. \n Exemple :</br> `{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}`","settings.showNotifications.always.description":"Afficher toutes les notifications.","settings.showNotifications.description":"Contrôle quand les notifications sont affichées par cette extension.  Les valeurs acceptées sont 'onError', 'onWarning', 'always' et 'off'.","settings.showNotifications.off.description":"Ne jamais afficher de notification. Les erreurs ou les avertissements sont toujours disponibles dans les journaux.","settings.showNotifications.onError.description":"Afficher les notifications pour les erreurs.","settings.showNotifications.onWarning.description":"Afficher les notifications d’erreurs et d’avertissements."}
