{"command.restartServer":"Sunucuyu Yeniden Başlatın","extension.description":"Pylint kullanan Python dosyaları için linting desteği.","settings.args.description":"Python dosyalarına lint uygulamak için Pylint'e geçirilen bağımsız değişkenler. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. \n Örnekler:  \n- `\"pylint.args\": [\"--rcfile=<file>\"]` \n - `\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Python dosyalarına Pylint ile linting uygulamak için kullanılan geçerli çalışma dizinini ayarlar. Varsayılan olarak, '${workspaceFolder}' çalışma alanının kök dizinini kullanır. Pylint için çalışma dizini olarak linting uygulanan dosyanın üst klasörünü kullanmak için `${fileDirname}` olarak ayarlayabilirsiniz.","settings.enabled.description":"Pylint ile Python dosyalarının astarlanmasını etkinleştirin/devre dışı bırakın.","settings.ignorePatterns.description":"Dosya veya klasörlerin Pylint ile lint işleminden hariç tutulmaları için [glob desenlerini](https://docs.python.org/3/library/fnmatch.html) fnmatch Python kitaplığı tarafından desteklendiği gibi yapılandırın.","settings.importStrategy.description":"Python dosyalarına lint uygulamak için kullanılacak Pylint ikili dosyasını tanımlar. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen Pylint ikili dosyasını kullanır. `fromEnvironment` olarak ayarlandığında, uzantı Pylint ikili dosyasını ve şu anda seçili ortamda kullanılabilen tüm bağımlılıkları kullanmaya çalışılır. Not: Uzantı seçili ortamda geçerli bir Pylint ikili dosyası bulamazsa, uzantıyla birlikte gönderilen Pylint ikili dosyasını kullanmaya geri döner. Bu ayar `fromEnvironment` olarak ayarlandığında `pylint.path` ayarı da yoksayılabilir.","settings.importStrategy.fromEnvironment.description":"Seçili ortamdan Pylint kullanın. Uzantı geçerli bir Pylint ikili dosyası bulamazsa, Pylint'in paketlenmiş sürümünü kullanmaya geri döner.","settings.importStrategy.useBundled.description":"Her zaman uzantıyla birlikte gönderilen Pylint'in paketlenmiş sürümünü kullan.","settings.interpreter.description":"Pylint sunucusunu ve herhangi bir alt işlemi başlatmak için kullanılacak bir Python yürütülebilir dosyasının veya komutun yolu. Tek veya birden çok dizenin dizisini kabul eder.  `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır.","settings.lintOnChange.description":"Python dosyalarını yazarken Pylint ile linting uygulamayı etkinleştirin.","settings.path.description":"Pylint ile Python dosyalarına lint uygulamak için uzantı tarafından kullanılacak yol veya komut. Tek veya birden çok dizenin dizisini kabul eder. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır. `[\"pylint\"]` olarak ayarlanırsa, `PATH` ortam değişkende kullanılabilen Pylint sürümünü kullanır. Not: Bu seçeneğin kullanılması, linting işlemini yavaşlatabilir. \nÖrnekler: \n- `[\"~/global_env/pylint\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"]` \n `[\"pylint\"]`","settings.severity.description":"Pylint'in ileti türlerinin, Sorunlar penceresinde görüntülendiği şekilde VS Code'un tanılama önem düzeyleriyle eşlenmesi. Belirli Pylint hata kodlarını geçersiz kılmak için de bunu kullanabilirsiniz. \n Örnek:</br> `{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}`","settings.showNotifications.always.description":"Tüm bildirimleri göster.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.  Kabul edilen değerler: `onError`, `onWarning`, `always` ve `off`.","settings.showNotifications.off.description":"Hiçbir zaman bildirim görüntüleme. Tüm hatalar veya uyarılar günlüklerde kalır.","settings.showNotifications.onError.description":"Hatalar için bildirimleri göster.","settings.showNotifications.onWarning.description":"Hata ve uyarı bildirimlerini göster."}
