{"command.restartServer":"Ponowne uruchamianie serwera","extension.description":"Obsługa sprawdzania dla plików języka Python przy użyciu narzędzia Pylint.","settings.args.description":"Argumenty przekazane do narzędzia Pylint na potrzeby sprawdzania plików języka Python. Każdy argument powinien być podany jako oddzielny ciąg w tablicy. \n Przykłady:  \n— „\"pylint.args\": [\"--rcfile=<file>\"]” \n — „\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]”","settings.cwd.description":"Ustawia bieżący katalog roboczy używany do sprawdzania plików języka Python za pomocą narzędzia Pylint. Domyślnie używa katalogu głównego obszaru roboczego „${workspaceFolder}”. Możesz ustawić dla niego wartość „${fileDirname}”, aby użyć folderu nadrzędnego pliku, który jest sprawdzany, jako katalogu roboczego dla narzędzia Pylint.","settings.enabled.description":"Włącz/wyłącz linting plików języka Python za pomocą narzędzia Pylint.","settings.ignorePatterns.description":"Skonfiguruj [wzorce globalne](https://docs.python.org/3/library/fnmatch.html) obsługiwane przez bibliotekę języka Python fnmatch, aby wykluczyć pliki lub foldery ze sprawdzania przez narzędzie Pylint.","settings.importStrategy.description":"Definiuje, który plik binarny Pylint ma być używany do sprawdzania plików języka Python. W przypadku ustawienia wartości „useBundled” rozszerzenie będzie używać pliku binarnego Pylint dostarczonego z rozszerzeniem. W przypadku ustawienia wartości „fromEnvironment” rozszerzenie podejmie próbę użycia pliku binarnego Pylint i wszystkich zależności dostępnych w obecnie wybranym środowisku. Uwaga: jeśli rozszerzenie nie może odnaleźć prawidłowego pliku binarnego Pylint w wybranym środowisku, powróci do użycia pliku binarnego Pylint dostarczonego z rozszerzeniem. Ustawienie „pylint.path” może być również ignorowane, gdy ma ono wartość „fromEnvironment”.","settings.importStrategy.fromEnvironment.description":"Użyj narzędzia Pylint z wybranego środowiska. Jeśli rozszerzenie nie może znaleźć prawidłowego pliku binarnego Pylint, powróci do używania powiązanej wersji narzędzia Pylint.","settings.importStrategy.useBundled.description":"Zawsze używaj dołączonej wersji narzędzia Pylint dostarczanej z rozszerzeniem.","settings.interpreter.description":"Ścieżka do pliku wykonywalnego języka Python lub polecenia, które będzie używane do uruchamiania serwera Pylint i dowolnego podprocesu. Akceptuje tablicę jednego lub wielu ciągów.  Po ustawieniu wartości „[]” rozszerzenie użyje ścieżki do wybranego interpretera języka Python. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy.","settings.lintOnChange.description":"Włącz sprawdzanie plików języka Python przy użyciu narzędzia Pylint podczas pisania.","settings.path.description":"Ścieżka lub polecenie, które ma być używane przez rozszerzenie do sprawdzania plików języka Python za pomocą narzędzia Pylint. Akceptuje tablicę jednego lub wielu ciągów. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy. W przypadku ustawienia wartości „[\"pylint\"]” będzie używana wersja narzędzia Pylint dostępna w zmiennej środowiskowej „PATH”. Uwaga: użycie tej opcji może spowolnić sprawdzanie. \nPrzykłady: \n— „[\"~/global_env/pylint\"]” \n— „[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"]” \n „[\"pylint\"]”","settings.severity.description":"Mapowanie typów komunikatów narzędzia Pylint na poziomy ważności diagnostycznej programu VS Code, jak pokazano w oknie Problemy. Można go również użyć do zastąpienia określonych kodów błędów narzędzia Pylint. \n Przykład:</br> „{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}”","settings.showNotifications.always.description":"Pokaż wszystkie powiadomienia.","settings.showNotifications.description":"Określa, kiedy powiadomienia są wyświetlane przez to rozszerzenie.  Akceptowane wartości to „onError”, „onWarning”, „always” i „off”.","settings.showNotifications.off.description":"Nigdy nie wyświetlaj powiadomienia. Wszelkie błędy lub ostrzeżenia są nadal dostępne w dziennikach.","settings.showNotifications.onError.description":"Pokaż powiadomienia o błędach.","settings.showNotifications.onWarning.description":"Pokaż powiadomienia o błędach i ostrzeżeniach."}
