{"command.restartServer":"Restartovat server","extension.description":"Podpora lintování pro soubory Pythonu přes Pylint.","settings.args.description":"Argumenty předané Pylintu pro lintování souborů Pythonu. Každý argument by měl být v poli zadán jako samostatný řetězec. \n Příklady:  \n- `\"pylint.args\": [\"--rcfile=<file>\"]` \n - `\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Nastaví aktuální pracovní adresář, který se používá k lintování souborů Pythonu pomocí Pylintu. Standardně používá kořenový adresář pracovního prostoru ${workspaceFolder}. Můžete ho nastavit na ${fileDirname}, aby se jako pracovní adresář pro Pylint použila nadřazená složka souboru, který se lintuje.","settings.enabled.description":"Povolí lintování souborů Pythonu pomocí Pylintu.","settings.ignorePatterns.description":"Nakonfigurujte [vzory glob](https://docs.python.org/3/library/fnmatch.html), jak je podporuje knihovna fnmatch Pythonu, abyste vyloučili soubory nebo složky z lintování pomocí Pylintu.","settings.importStrategy.description":"Definuje, který binární soubor Binint se má použít k lintování souborů Pythonu. Pokud je nastaveno na useBundled, rozšíření použije binární soubor Pylint, který je dodáván s rozšířením. Pokud je nastaveno na fromEnvironment, rozšíření se pokusí použít binární soubor Pylint a všechny závislosti, které jsou k dispozici v aktuálně vybraném prostředí. Poznámka: Pokud rozšíření nemůže ve vybraném prostředí najít platný binární soubor Pylint, použije se binární soubor Pylint dodávaný s rozšířením. Pokud je toto nastavení nastaveno na fromEnvironment, může být ignorováno také nastavení pylint.path.","settings.importStrategy.fromEnvironment.description":"Umožňuje použít Pylint z vybraného prostředí. Pokud rozšíření nenajde platný binární soubor Pylint, použije místo toho zkompletovanou verzi Pylintu dodávanou s rozšířením.","settings.importStrategy.useBundled.description":"Vždy používat zkompletovanou verzi Pylintu dodanou s rozšířením.","settings.interpreter.description":"Cesta ke spustitelnému souboru Pythonu nebo k příkazu, který se použije ke spuštění serveru Pylint a jakéhokoli podprocesu. Přijímá pole jednoho nebo více řetězců.  Když se nastaví na [], rozšíření použije cestu k vybranému interpretu Pythonu. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli.","settings.lintOnChange.description":"Povolí lintování souborů Pythonu pomocí Pylintu během psaní.","settings.path.description":"Cesta nebo příkaz, které má rozšíření použít k lintování souborů Pythonu pomocí Pylintu. Přijímá pole jednoho nebo více řetězců. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli. Pokud je nastaveno na [\"pylint\"], použije se verze Pylintu dostupná v proměnné prostředí PATH. Poznámka: Použití této možnosti může zpomalit lintování. \nPříklady: \n- `[\"~/global_env/pylint\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"]` \n `[\"pylint\"]`","settings.severity.description":"Mapování typů zpráv Pylint na diagnostické úrovně závažnosti VS Code, jak se zobrazují v okně Problémy. Můžete ho také použít k přepsání konkrétních kódů chyb Pylint. \n Příklad:</br> `{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}`","settings.showNotifications.always.description":"Zobrazí všechna oznámení.","settings.showNotifications.description":"Určuje, kdy toto rozšíření zobrazuje oznámení.  Přípustné hodnoty jsou onError, onWarning, always a off.","settings.showNotifications.off.description":"Nikdy nezobrazí oznámení. Všechny chyby nebo upozornění jsou stále k dispozici v protokolech.","settings.showNotifications.onError.description":"Zobrazí oznámení o chybách.","settings.showNotifications.onWarning.description":"Zobrazí oznámení o chybách a upozorněních."}
