{"command.restartServer":"Riavvia server","extension.description":"Supporto linting per i file Python con Pylint.","settings.args.description":"Argomenti passati a Pylint per il linting dei file Python. Ogni argomento deve essere fornito come stringa separata nella matrice. \n Esempi:  \n- '\"pylint.args\": [\"--rcfile=<file>\"]' \n - '\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]'","settings.cwd.description":"Imposta la directory di lavoro corrente usata per il lint dei file Python con Pylint. Per impostazione predefinita, usa la directory radice dell’area di lavoro `${workspaceFolder}`. È possibile impostare su `${fileDirname}` per usare la cartella padre del file per cui viene effettuato il lint come directory di lavoro per Pylint.","settings.enabled.description":"Abilitare/disabilitare il linting dei file Python con Pylint.","settings.ignorePatterns.description":"Configurare [glob patterns](https://docs.python.org/3/library/fnmatch.html) come supportato dalla libreria Python fnmatch per escludere i file o le cartelle dall'unione con Pylint.","settings.importStrategy.description":"Definisce il file binario di Pylint da usare per il lint dei file Python. Quando è impostata su `useBundled`, l'estensione userà il file binario di Pylint fornito con l'estensione. Se impostata su `fromEnvironment`, l'estensione tenterà di usare il file binario di Pylint e tutte le dipendenze disponibili nell'ambiente attualmente selezionato. Nota: se l'estensione non riesce a trovare un file binario Pylint valido nell'ambiente selezionato, verrà eseguito all'uso del file binario di Pylint fornito con l'estensione Impostazione `pylint.path` può anche essere ignorata quando questa impostazione è impostata su `fromEnvironment`.","settings.importStrategy.fromEnvironment.description":"Usare Pylint dall'ambiente selezionato. Se l'estensione non riesce a trovare un file binario Pylint valido, verrà eseguito il fallback all'uso della versione in bundle di Pylint.","settings.importStrategy.useBundled.description":"Usare sempre la versione in bundle di Pylint fornita con l'estensione.","settings.interpreter.description":"Percorso di un eseguibile Python o di un comando che verrà usato per avviare il server Pylint e qualsiasi sottoprocesso. Accetta una matrice di una o più stringhe.  Se impostata su '[]', l'estensione userà il percorso dell'interprete Python selezionato. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice.","settings.lintOnChange.description":"Abilita il linting dei file Python con Pylint durante la digitazione.","settings.path.description":"Percorso o comando che l'estensione deve usare per il lint dei file Python con Pylint. Accetta una matrice di una o più stringhe. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice. Se impostato su `[\"pylint\"]`, userà la versione di Pylint disponibile nella variabile d'ambiente `PATH`. Nota: l'uso di questa opzione può rallentare il linting. \nEsempi: \n- '[\"~/global_env/pylint\"]' \n- '[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"]' \n '[\"pylint\"]'","settings.severity.description":"Mapping dei tipi di messaggio di Pylint con i livelli di gravità diagnostica di VS Code, come visualizzato nella finestra Problemi. È anche possibile usarlo per eseguire l'override di specifici codici di errore di Pylint. \n Esempio:</br> '{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}'","settings.showNotifications.always.description":"Mostra tutte le notifiche.","settings.showNotifications.description":"Controlla quando mostrare le notifiche da questa estensione.  I valori accettati sono 'onError', 'onWarning', 'always' e 'off'.","settings.showNotifications.off.description":"Non visualizzare mai una notifica. Eventuali errori o avvisi sono ancora disponibili nei log.","settings.showNotifications.onError.description":"Mostra le notifiche per gli errori.","settings.showNotifications.onWarning.description":"Mostra le notifiche per errori e avvisi."}
