{"command.restartServer":"Перезапустить сервер","extension.description":"Поддержка анализа кода (lint) для файлов Python с использованием \"pylint\".","settings.args.description":"Аргументы, передаваемые в Pylint для проведения анализа lint над файлами Python. Каждый аргумент должен быть указан как отдельная строка в массиве. \n Примеры:  \n- `\"pylint.args\": [\"--rcfile=<файл>\"]` \n - `\"pylint.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Задает текущий рабочий каталог, используемый для анализа lint файлов Python с помощью Pylint. По умолчанию используется корневой каталог рабочей области \"${workspaceFolder}\". Можно задать значение \"${fileDirname}\", чтобы использовать родительскую папку файла, который находится в качестве рабочего каталога для Pylint.","settings.enabled.description":"Включить или отключить проверку файлов Python с помощью Pylint.","settings.ignorePatterns.description":"Настройте [стандартную маску](https://docs.python.org/3/library/fnmatch.html), поддерживаемую библиотекой Python fnmatch, чтобы исключить файлы или папки из анализа кода посредством Pylint.","settings.importStrategy.description":"Определяет, какой двоичный файл Pylint будет использоваться для операции lint над файлами Python. Если для этого параметра задано значение \"useBundled\" (использовать пакетный), расширение будет использовать двоичный файл Pylint, поставляемый вместе с расширением. Если задан параметр \"fromEnvironment\" (из среды), расширение попытается использовать двоичный файл Pylint и все зависимости, доступные в текущей среде. Примечание. Если расширение не может найти допустимый двоичный файл Pylint в выбранной среде, оно будет использовать двоичный файл Pylint, который поставляется вместе с расширением. Значение параметра \"pylint.path\" может также игнорироваться, если для этого параметра установлено \"fromEnvironment\".","settings.importStrategy.fromEnvironment.description":"Используйте Pylint из выбранной среды. Если расширению не удается найти допустимый двоичный файл Pylint, оно будет использовать пакетную версию Pylint.","settings.importStrategy.useBundled.description":"Всегда использовать пакетную версию Pylint, поставляемую с расширением.","settings.interpreter.description":"Путь к исполняемому файлу Python или команде, которая будет использоваться для запуска сервера Pylint и всех подпроцессов. Принимает массив из одной или нескольких строк.  Если задано значение \"[]\", расширение будет использовать путь к выбранному интерпретатору Python. При передаче команды каждый аргумент должен быть указан как отдельная строка в массиве.","settings.lintOnChange.description":"Включите операцию lint на файлах Python с помощью Pylint при введении текста.","settings.path.description":"Путь или команда, используемые расширением для анализа кода lint в файлах Python с помощью Pylint. Принимает массив из одной или нескольких строк. При передаче команды каждый аргумент должен быть указан как отдельная строка в массиве. Если задан параметр [\"pylint\"], будет использоваться версия Pylint, доступная в переменной среды PATH. Примечание. Установка значения \"false\" для этого параметра может привести к замедлению анализа кода. \nПримеры: \n- [\"~/global_env/pylint\"] \n- [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"pylint\"] \n `[\"pylint\"]`","settings.severity.description":"Сопоставление типов сообщений Pylint с уровнями серьезности диагностики VS Code для показа в окне \"Проблемы\". Его также можно использовать для переопределения определенных кодов ошибок Pylint. \n Пример:</br> \"{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}\"","settings.showNotifications.always.description":"Показывать все уведомления","settings.showNotifications.description":"Определяет, когда расширение показывает уведомления.  Допустимые значения: \"onError\" (в случае ошибки), \"onWarning\" (в случае предупреждения), \"always\" (всегда) и \"off\" (отключено).","settings.showNotifications.off.description":"Никогда не показывать уведомлений. Все ошибки и предупреждения по-прежнему доступны в журналах.","settings.showNotifications.onError.description":"Показывать уведомления в случае ошибок.","settings.showNotifications.onWarning.description":"Показ уведомлений об ошибках и предупреждениях."}
