{"command.restartServer":"Rëstært §ërvër","extension.description":"£ïñtïñg sµppørt før Pÿthøñ fïlës µsïñg Pÿlïñt.","settings.args.description":"Ærgµmëñts pæssëð tø Pÿlïñt før lïñtïñg Pÿthøñ fïlës. Ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. \n Ëxæmplës:  \n- `\"pÿlïñt.ærgs\": [\"--rçfïlë=<fïlë>\"]` \n - `\"pÿlïñt.ærgs\": [\"--ðïsæþlë=Ç0111\", \"--mæx-lïñë-lëñgth=120\"]`","settings.cwd.description":"§ëts thë çµrrëñt wørkïñg ðïrëçtørÿ µsëð tø lïñt Pÿthøñ fïlës wïth Pÿlïñt. ßÿ ðëfæµlt, ït µsës thë røøt ðïrëçtørÿ øf thë wørkspæçë `${wørkspæçëFølðër}`. Ýøµ çæñ sët ït tø `${fïlëÐïrñæmë}` tø µsë thë pærëñt følðër øf thë fïlë þëïñg lïñtëð æs thë wørkïñg ðïrëçtørÿ før Pÿlïñt.","settings.enabled.description":"Ëñæþlë/ðïsæþlë lïñtïñg Pÿthøñ fïlës wïth Pÿlïñt.","settings.ignorePatterns.description":"Çøñfïgµrë [gløþ pættërñs](https://ðøçs.pÿthøñ.ørg/3/lïþrærÿ/fñmætçh.html) æs sµppørtëð þÿ thë fñmætçh Pÿthøñ lïþrærÿ tø ëxçlµðë fïlës ør følðërs frøm þëïñg lïñtëð wïth Pÿlïñt.","settings.importStrategy.description":"Ðëfïñës whïçh Pÿlïñt þïñærÿ tø þë µsëð tø lïñt Pÿthøñ fïlës. Whëñ sët tø `µsëßµñðlëð`, thë ëxtëñsïøñ wïll µsë thë Pÿlïñt þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Whëñ sët tø `frømËñvïrøñmëñt`, thë ëxtëñsïøñ wïll ættëmpt tø µsë thë Pÿlïñt þïñærÿ æñð æll ðëpëñðëñçïës thæt ærë ævæïlæþlë ïñ thë çµrrëñtlÿ sëlëçtëð ëñvïrøñmëñt. Ñøtë: Ïf thë ëxtëñsïøñ çæñ't fïñð æ vælïð Pÿlïñt þïñærÿ ïñ thë sëlëçtëð ëñvïrøñmëñt, ït wïll fællþæçk tø µsïñg thë Pÿlïñt þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ Thë `pÿlïñt.pæth` sëttïñg mæÿ ælsø þë ïgñørëð whëñ thïs sëttïñg ïs sët tø `frømËñvïrøñmëñt`.","settings.importStrategy.fromEnvironment.description":"Üsë Pÿlïñt frøm thë sëlëçtëð ëñvïrøñmëñt. Ïf thë ëxtëñsïøñ fæïls tø fïñð æ vælïð Pÿlïñt þïñærÿ, ït wïll fællþæçk tø µsïñg thë þµñðlëð vërsïøñ øf Pÿlïñt.","settings.importStrategy.useBundled.description":"Ælwæÿs µsë thë þµñðlëð vërsïøñ øf Pÿlïñt shïppëð wïth thë ëxtëñsïøñ.","settings.interpreter.description":"Pæth tø æ Pÿthøñ ëxëçµtæþlë ør æ çømmæñð thæt wïll þë µsëð tø læµñçh thë Pÿlïñt sërvër æñð æñÿ sµþprøçëss. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs.  Whëñ sët tø `[]`, thë ëxtëñsïøñ wïll µsë thë pæth tø thë sëlëçtëð Pÿthøñ ïñtërprëtër. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ.","settings.lintOnChange.description":"Ëñæþlë lïñtïñg Pÿthøñ fïlës wïth Pÿlïñt æs ÿøµ tÿpë.","settings.path.description":"Pæth ør çømmæñð tø þë µsëð þÿ thë ëxtëñsïøñ tø lïñt Pÿthøñ fïlës wïth Pÿlïñt. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. Ïf sët tø `[\"pÿlïñt\"]`, ït wïll µsë thë vërsïøñ øf Pÿlïñt ævæïlæþlë ïñ thë `PÆTH` ëñvïrøñmëñt værïæþlë. Ñøtë: Üsïñg thïs øptïøñ mæÿ sløwðøwñ lïñtïñg. \nËxæmplës: \n- `[\"~/gløþæl_ëñv/pÿlïñt\"]` \n- `[\"çøñðæ\", \"rµñ\", \"-ñ\", \"lïñt_ëñv\", \"pÿthøñ\", \"-m\", \"pÿlïñt\"]` \n `[\"pÿlïñt\"]`","settings.severity.description":"Mæppïñg øf Pÿlïñt's mëssægë tÿpës tø V§ Çøðë's ðïægñøstïç sëvërïtÿ lëvëls æs ðïsplæÿëð ïñ thë Prøþlëms wïñðøw. Ýøµ çæñ ælsø µsë ït tø øvërrïðë spëçïfïç Pÿlïñt ërrør çøðës. \n Ëxæmplë:</þr> `{\"çøñvëñtïøñ\": \"Ïñførmætïøñ\", \"ërrør\": \"Ërrør\", \"fætæl\": \"Ërrør\", \"rëfæçtør\": \"Hïñt\", \"wærñïñg\": \"Wærñïñg\", \"W0611\": \"Ërrør\", \"µñðëfïñëð-værïæþlë\": \"Wærñïñg\"}`","settings.showNotifications.always.description":"§høw æll ñøtïfïçætïøñs.","settings.showNotifications.description":"Çøñtrøls whëñ ñøtïfïçætïøñs ærë shøwñ þÿ thïs ëxtëñsïøñ.  Æççëptëð vælµës ærë `øñËrrør`, `øñWærñïñg`, `ælwæÿs` æñð `øff`.","settings.showNotifications.off.description":"Ñëvër ðïsplæÿ æ ñøtïfïçætïøñ. Æñÿ ërrørs ør wærñïñg ærë stïll ævæïlæþlë ïñ thë løgs.","settings.showNotifications.onError.description":"§høw ñøtïfïçætïøñs før ërrørs.","settings.showNotifications.onWarning.description":"§høw ñøtïfïçætïøñs før ërrørs æñð wærñïñgs."}
